using System;

class Program
{
    static void Main()
    {
        short n;        // параметр зовнішнього циклу
        double x, y;    // абсциса і ордината графіка
        short h;        // позиція точки на екрані

        // зовнішній цикл - для 5 періодів
        for (n = 0; n < 5; n++)
        {
            Console.WriteLine("|   x   |      y     |");
            Console.WriteLine("|-------|------------|");

            // внутрішній цикл для одного періоду
            for (x = 0; x < 4; x += 0.25)
            {
                // 1-й відрізок
                if (x < 2)
                    y = 2 * Math.Sin(0.8 * x);
                // 2-й відрізок
                else if (x == 2)
                    y = 2;
                // 3-й відрізок
                else
                    y = -2 * Math.Sin(0.8 * x);

                // виведення рядка таблиці
                Console.Write("| {0,5:0.00} | {1,10:0.0000000} |", x + n * 4, y);

                if (x == 2)
                {
                    // Спеціальний випадок для x = 2: Виведення кількох зірочок
                    Console.WriteLine(" *         *         *        *        *");
                }
                else
                {
                    // визначення позиції точки
                    h = (short)((y + 2) * 10);  // Змінив діапазон для кращого відображення графіка
                    if (y + 2 - h / 10.0 > 0.5) h++;

                    // виведення точки графіка
                    for (; h > 0; h--) Console.Write(" ");
                    Console.WriteLine("*");
                }
            } 
        }
        Console.WriteLine("Натиснiть будь-яку клавiшу щоб завершити програму...");
        Console.ReadLine();
    }
}